posts/hockey-bots-creating-ai-for-slapshot-rebound/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Hockey Bots - Creating AI for Slapshot-Rebound | im_oisin</title>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://imois.in/posts/hockey-bots-creating-ai-for-slapshot-rebound/">
<link rel="icon" href="../../icon/favicon.ico" sizes="16x16">
<link rel="icon" href="../../icon/icon_128x128.png" sizes="128x128">
<!--[if lt IE 9]><![endif]--><link href="https://code.jquery.com/ui/1.10.2/themes/smoothness/jquery-ui.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/cookies-eu-banner.default.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/sudoku.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/font-awesome.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/bnw.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="author" content="Oisin Carroll">
<meta property="og:site_name" content="im_oisin">
<meta property="og:title" content="Hockey Bots - Creating AI for Slapshot-Rebound">
<meta property="og:url" content="https://imois.in/posts/hockey-bots-creating-ai-for-slapshot-rebound/">
<meta property="og:description" content="Introduction


Earlier in the year I developed the bots for Oddshot Games' title Slapshot Rebound. I've kindly been given permission to share some of the more interesting parts. This includes a new (a">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2022-05-20T00:57:49+01:00">
</head>
<body>

    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://imois.in/" title="im_oisin" rel="home">
                im_oisin
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../games">Games</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../pages/about-me">About Me</a></li>
                <li><a href="../../pages/freelance">Freelance</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Hockey Bots - Creating AI for Slapshot-Rebound
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2022-05-20T00:57:49+01:00">2022/05/20</time><!-- 
        &nbsp;&nbsp;|&nbsp;&nbsp;
        <a href="/posts/hockey-bots-creating-ai-for-slapshot-rebound/index.org" id="sourcelink">Source</a>
-->
</div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-orga61e3ba" class="outline-2">
<h2 id="orga61e3ba">Introduction</h2>
<div class="outline-text-2" id="text-orga61e3ba">
<p>
Earlier in the year I developed the bots for Oddshot Games' title Slapshot Rebound. I've kindly been given permission to share some of the more interesting parts. This includes a new (afaik at least) method for performing spacial queries (e.g. distance to goal, direction to nearest wall, distance puck is from wall), as well as a novel architecture for game AI I found effective and more scaleable than state machines or behavior trees. If that sounds interesting… Stay tuned!
</p>

<p>
&lt; TODO: AI Gifs &gt;
</p>

<p>
The bots can accurately control the puck, including executing maneuvers to lift the puck off the edges of the rink, as well as pass and shoot.
</p>

<p>
I'm by no means an expert in the area, but I managed to adapt some interesting physics and maths for the task. Hopefully if you're developing something similar, this'll provide some inspiration!
</p>
</div>
</div>

<div id="outline-container-orgd54866a" class="outline-2">
<h2 id="orgd54866a">Character movement (PD Controller)</h2>
<div class="outline-text-2" id="text-orgd54866a">
<p>
Before working on the brain of the bots, it's nice to get a good foundation - give the bots good mechanics. This covers simple movement of the characters and control of the puck itself.
</p>
</div>

<div id="outline-container-org7a9e26f" class="outline-3">
<h3 id="org7a9e26f">Movement</h3>
<div class="outline-text-3" id="text-org7a9e26f">
<p>
We'd like to be able to move the character to any point on the pitch, without overshooting. Ideally the character moves smoothly as fast as possible - slowing to a stop on the target point.
</p>

<p>
A simple solution might look something like - if we're to the left of the target then move the control stick to the left, otherwise if we're to the right then move the control stick to the right. This is simply a proportional controller, where the output (left or right button) is directly proportional to the error term (signed distance to the target).
</p>

<p>
Formally we write the error at time t as \(e(t)\), so the control function of this controller is written as.
</p>

<p>
\[
u(t) = K_pe(t)
\]
</p>

<p>
where \(K_p\) is a constant weight - determining 'how much' we'd like to move the stick.
</p>

<p>
Unfortunately, this causes the character to overshoot. We'll continue to accelerate right up until we reach the target and blaze right past it.
</p>

<p>
&lt;TODO: GIF of character overshooting&gt;
</p>

<p>
It needs to de-accelerate before reaching the target, based on how fast it's moving. We introduce another term - the current velocity towards the target. Similarly this gets it's own linear weighting - \(K_d\), as the \(d\) denotes that velocity is the derivative of distance. This is a PD Controller.
</p>

<p>
\[
u(t) = K_pe(t) + K_de'(t)
\]
</p>

<p>
The bots use a vectorized version of this to control movement in the 2d plane of the pitch, and with some 'very scientific' tuning of \(K_p\) and \(K_d\), the bots move perfectly!
</p>

<p>
&lt;TODO: Some GIF of movement&gt;
</p>

<p>
An extension of this - a PID controller introduces another 'integral' term to correct steady state errors, and is extremely common across robotics, electronics and more.
</p>
</div>
</div>

<div id="outline-container-org2922681" class="outline-3">
<h3 id="org2922681">Puck control</h3>
</div>
</div>

<div id="outline-container-orge9ca816" class="outline-2">
<h2 id="orge9ca816">Fast approximate spatial queries</h2>
<div class="outline-text-2" id="text-orge9ca816">
</div>
<div id="outline-container-orgab50a08" class="outline-3">
<h3 id="orgab50a08">Distances</h3>
</div>
<div id="outline-container-orge2cfc12" class="outline-3">
<h3 id="orge2cfc12">Gradients</h3>
</div>
<div id="outline-container-org333ea25" class="outline-3">
<h3 id="org333ea25">Collisions</h3>
</div>
<div id="outline-container-orgcd0d1e1" class="outline-3">
<h3 id="orgcd0d1e1">Fast puck predictions</h3>
</div>
</div>

<div id="outline-container-orgdf344a1" class="outline-2">
<h2 id="orgdf344a1">Behaviour state tree architecture</h2>
<div class="outline-text-2" id="text-orgdf344a1">
<p>
Creating complex game AI is hard. An ideal system has modular code that can be reused, it's easy to interpret and track down bugs, it's easy to test, it's scalable, and it's possible to write complex code.
The AI for Slapshot had an additional constraint, it should play equally well with human and AI teammates.
</p>
</div>

<div id="outline-container-org2a088a1" class="outline-3">
<h3 id="org2a088a1">Why not a behaviour tree</h3>
</div>
<div id="outline-container-org58d20d0" class="outline-3">
<h3 id="org58d20d0">Why not a state machine</h3>
</div>
<div id="outline-container-org859e728" class="outline-3">
<h3 id="org859e728">Best of both worlds!</h3>
</div>
</div>

<div id="outline-container-org7ac8dca" class="outline-2">
<h2 id="org7ac8dca">AI Test Framework</h2>
</div>

<div id="outline-container-org7d7c263" class="outline-2">
<h2 id="org7d7c263">'Posture' behaviour</h2>
</div>
        
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"] ],
        displayMath: [ ['$$','$$'], ["\\[","\\]"] ],
        processEscapes: true
    },
    "HTML-CSS": {
        styles: {'.MathJax_Display': {"margin": 0}}
    }
});
</script>
</div>
    </div>

    
    <footer><div class="container">
            <div class="social">
                <div class="social-entry">
                    <a href="mailto:oisincar@gmail.com" target="_blank">
                        <i class="fa fa-envelope-o"></i>
                    </a>
                </div>


                <div class="social-entry">
                    <a href="https://github.com/oisincar" target="_blank">
                        <i class="fa fa-github"></i>
                    </a>
                </div>

                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2023         <a href="mailto:oisincar@gmail.com">Oisin Carroll</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><div id="cookies-eu-banner" style="display: none; position:fixed; bottom: 0;">
        By continuing to visit this site, you accept the use of cookies by Google Analytics and Google Adsense.
        <a href="https://imois.in/pages/privacy-policy/" id="cookies-eu-more">Read more</a>
        <button id="cookies-eu-reject">Reject</button>
        <button id="cookies-eu-accept">Accept</button>
    </div>

    
<script src="../../assets/js/cookies-eu-banner.js"></script><script>

CookiesEuBanner.prototype.setCookie = function(name, value) {
  var date = new Date();
  date.setTime(date.getTime() + this.cookieTimeout);

  document.cookie = name + '=' + value + ';expires=' + date.toGMTString() + ';path=/' + ';secure;SameSite=Lax';
}


    new CookiesEuBanner(function () {
        // Your code to launch when user accept cookies
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

        console.log("Enabling google analytics!");

        ga('create', 'UA-143421297-1', 'auto');
        ga('send', 'pageview');


        // TODO: Set up adsense here..??
    }, true);

</script><script src="../../assets/js/jquery-1.10.2.min.js" type="text/javascript"></script><script src="../../assets/js/headroom.min.js" type="text/javascript"></script><script src="../../assets/js/scripts.js" type="text/javascript"></script><div>
</div>
</body>
</html>
